I am experiencing exactly the same issue. When changing a `opentelekomcloud_as_configuration_v1` the provider tries to delete the `opentelekomcloud_as_configuration_v1` which it can´t because it is still used by the the mrespective `opentelekomcloud_as_group_v1`.
However, I would have expect the provider to:
1. Create a new `opentelekomcloud_as_configuration_v1`
2. Update the `opentelekomcloud_as_group_v1` to use the new  `opentelekomcloud_as_configuration_v1`
3. Delete the old  `opentelekomcloud_as_configuration_v1`

## Code to reproduce
```
resource "opentelekomcloud_as_configuration_v1" "xyz" {
  scaling_configuration_name = "xyz"
  instance_config {
    flavor = "s2.large.4"
    image = "320457b8-88c2-43b9-8920-***"
    disk {
      size = 40
      volume_type = "SATA"
      disk_type = "SYS"
    }
    key_name = opentelekomcloud_compute_keypair_v2.xyz.name
    user_data = file("user_data/init.sh")
  }
}

resource "opentelekomcloud_as_group_v1" "xyz" {
  scaling_group_name = "xyz"
  scaling_configuration_id = opentelekomcloud_as_configuration_v1.xyz.id
  desire_instance_number = 2
  min_instance_number = 0
  max_instance_number = 2
  networks {
    id = data.terraform_remote_state.network.outputs.network_id
  }
  security_groups {
    id = opentelekomcloud_compute_secgroup_v2.xyz.id
  }
  vpc_id = data.terraform_remote_state.network.outputs.vpc_id
  delete_publicip = true
  delete_instances = "yes"
}
```

## terraform plan
```
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # opentelekomcloud_as_configuration_v1.xyzmust be replaced
-/+ resource "opentelekomcloud_as_configuration_v1" "xyz" {
      ~ id                         = "2fe6b880-d741-4fac-b242-***" -> (known after apply)
      + region                     = (known after apply)
        scaling_configuration_name = "xyz"

      ~ instance_config {
            flavor    = "s2.large.4"
            image     = "320457b8-88c2-43b9-8920-***"
            key_name  = "ops"
          - metadata  = {} -> null
          ~ user_data = <<~EOT # forces replacement
              - #!/bin/bash
              ...
              + 2ba92ed0f4da7c58fa5c83c81ead4c8cb0373e3b
            EOT

          ~ disk {
                disk_type   = "SYS"
                size        = 40
                volume_type = "SATA"
            }

            public_ip {
                eip {
                    ip_type = "5_bgp"

                    bandwidth {
                        charging_mode = "traffic"
                        share_type    = "PER"
                        size          = 5
                    }
                }
            }
        }
    }

  # opentelekomcloud_as_group_v1.xyzwill be updated in-place
  ~ resource "opentelekomcloud_as_group_v1" "xyz" {
        cool_down_time               = 900
        current_instance_number      = 2
        delete_instances             = "yes"
        delete_publicip              = true
        desire_instance_number       = 2
        health_periodic_audit_method = "NOVA_AUDIT"
        health_periodic_audit_time   = 5
        id                           = "7241022d-51c6-4fcc-9754-***"
        instance_terminate_policy    = "OLD_CONFIG_OLD_INSTANCE"
        instances                    = [
            "164bf0f2-405a-4573-9edb-***",
            "a8699cd4-3dc1-4cca-9c8d-***",
        ]
        max_instance_number          = 2
        min_instance_number          = 0
        region                       = "eu-de"
      ~ scaling_configuration_id     = "2fe6b880-d741-4fac-b242-***" -> (known after apply)
        scaling_group_name           = "xyz"
        status                       = "INSERVICE"
        vpc_id                       = "ab2ca88f-53ca-4379-b08a-***"

        networks {
            id = "e3469248-24bf-43da-a7ad-***"
        }

        security_groups {
            id = "f1c5063d-6881-4b04-9118-***"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

## terraform apply
```
2020/06/25 16:12:31 [DEBUG] opentelekomcloud_as_configuration_v1.xyz: applying the planned Delete change
opentelekomcloud_as_configuration_v1.xyz: Destroying... [id=2fe6b880-d741-4fac-b242-***]
2020/06/25 16:12:31 [DEBUG] opentelekomcloud_as_configuration_v1.xyz: apply errored, but we're indicating that via the Error pointer rather than returning it: Can not delete the configuration "2fe6b880-d741-4fac-b242-***", it is used by AS groups [7241022d-51c6-4fcc-9754-***].
2020/06/25 16:12:31 [ERROR] <root>: eval: *terraform.EvalApplyPost, err: Can not delete the configuration "2fe6b880-d741-4fac-b242-***", it is used by AS groups [7241022d-51c6-4fcc-9754-***].
2020/06/25 16:12:31 [ERROR] <root>: eval: *terraform.EvalSequence, err: Can not delete the configuration "2fe6b880-d741-4fac-b242-***", it is used by AS groups [7241022d-51c6-4fcc-9754-***].
2020/06/25 16:12:31 [ERROR] <root>: eval: *terraform.EvalOpFilter, err: Can not delete the configuration "2fe6b880-d741-4fac-b242-***", it is used by AS groups [7241022d-51c6-4fcc-9754-***].

Error: Can not delete the configuration "2fe6b880-d741-4fac-b242-***", it is used by AS groups [7241022d-51c6-4fcc-9754-***].
```
